package com.javarush.task.task05.task0528;

/* 
Вывести на экран сегодняшнюю дату
*/

import sun.util.calendar.BaseCalendar;

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код

        System.out.println("22 07 2017");
    }
}
